# ZCoordinate

## Description
Returns the Z coordinate of the object relative to the layer plane.

```pascal
FUNCTION ZCoordinate(c : CRITERIA) : REAL;
```

```python

def vs.ZCoordinate(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|The search criteria string.|

## Version
Availability: from Vectorworks 2011
## Category
* Criteria